GopalSaraf/Practicals/PSDL/include/proc/pic18f8490.inc
// Register: LCDDATA17
#define LCDDATA17 LCDDATA17
LCDDATA17                                equ 0F76h
// bitfield definitions
LCDDATA17_LCDDATA17_POSN                 equ 0000h
LCDDATA17_LCDDATA17_POSITION             equ 0000h
LCDDATA17_LCDDATA17_SIZE                 equ 0008h
LCDDATA17_LCDDATA17_LENGTH               equ 0008h
LCDDATA17_LCDDATA17_MASK                 equ 00FFh
LCDDATA17_S40C2_POSN                     equ 0000h
LCDDATA17_S40C2_POSITION                 equ 0000h
LCDDATA17_S40C2_SIZE                     equ 0001h
LCDDATA17_S40C2_LENGTH                   equ 0001h
LCDDATA17_S40C2_MASK                     equ 0001h
LCDDATA17_S41C2_POSN                     equ 0001h
LCDDATA17_S41C2_POSITION                 equ 0001h
LCDDATA17_S41C2_SIZE                     equ 0001h
LCDDATA17_S41C2_LENGTH                   equ 0001h
LCDDATA17_S41C2_MASK                     equ 0002h
LCDDATA17_S42C2_POSN                     equ 0002h
LCDDATA17_S42C2_POSITION                 equ 0002h
LCDDATA17_S42C2_SIZE                     equ 0001h
LCDDATA17_S42C2_LENGTH                   equ 0001h
LCDDATA17_S42C2_MASK                     equ 0004h
LCDDATA17_S43C2_POSN                     equ 0003h
LCDDATA17_S43C2_POSITION                 equ 0003h
LCDDATA17_S43C2_SIZE                     equ 0001h
LCDDATA17_S43C2_LENGTH                   equ 0001h
LCDDATA17_S43C2_MASK                     equ 0008h
LCDDATA17_S44C2_POSN                     equ 0004h
LCDDATA17_S44C2_POSITION                 equ 0004h
LCDDATA17_S44C2_SIZE                     equ 0001h
LCDDATA17_S44C2_LENGTH                   equ 0001h
LCDDATA17_S44C2_MASK                     equ 0010h
LCDDATA17_S45C2_POSN                     equ 0005h
LCDDATA17_S45C2_POSITION                 equ 0005h
LCDDATA17_S45C2_SIZE                     equ 0001h
LCDDATA17_S45C2_LENGTH                   equ 0001h
LCDDATA17_S45C2_MASK                     equ 0020h
LCDDATA17_S46C2_POSN                     equ 0006h
LCDDATA17_S46C2_POSITION                 equ 0006h
LCDDATA17_S46C2_SIZE                     equ 0001h
LCDDATA17_S46C2_LENGTH                   equ 0001h
LCDDATA17_S46C2_MASK                     equ 0040h
LCDDATA17_S47C2_POSN                     equ 0007h
LCDDATA17_S47C2_POSITION                 equ 0007h
LCDDATA17_S47C2_SIZE                     equ 0001h
LCDDATA17_S47C2_LENGTH                   equ 0001h
LCDDATA17_S47C2_MASK                     equ 0080h
LCDDATA17_SEG40COM2_POSN                 equ 0000h
LCDDATA17_SEG40COM2_POSITION             equ 0000h
LCDDATA17_SEG40COM2_SIZE                 equ 0001h
LCDDATA17_SEG40COM2_LENGTH               equ 0001h
LCDDATA17_SEG40COM2_MASK                 equ 0001h
LCDDATA17_SEG41COM2_POSN                 equ 0001h
LCDDATA17_SEG41COM2_POSITION             equ 0001h
LCDDATA17_SEG41COM2_SIZE                 equ 0001h
LCDDATA17_SEG41COM2_LENGTH               equ 0001h
LCDDATA17_SEG41COM2_MASK                 equ 0002h
LCDDATA17_SEG42COM2_POSN                 equ 0002h
LCDDATA17_SEG42COM2_POSITION             equ 0002h
LCDDATA17_SEG42COM2_SIZE                 equ 0001h
LCDDATA17_SEG42COM2_LENGTH               equ 0001h
LCDDATA17_SEG42COM2_MASK                 equ 0004h
LCDDATA17_SEG43COM2_POSN                 equ 0003h
LCDDATA17_SEG43COM2_POSITION             equ 0003h
LCDDATA17_SEG43COM2_SIZE                 equ 0001h
LCDDATA17_SEG43COM2_LENGTH               equ 0001h
LCDDATA17_SEG43COM2_MASK                 equ 0008h
LCDDATA17_SEG44COM2_POSN                 equ 0004h
LCDDATA17_SEG44COM2_POSITION             equ 0004h
LCDDATA17_SEG44COM2_SIZE                 equ 0001h
LCDDATA17_SEG44COM2_LENGTH               equ 0001h
LCDDATA17_SEG44COM2_MASK                 equ 0010h
LCDDATA17_SEG45COM2_POSN                 equ 0005h
LCDDATA17_SEG45COM2_POSITION             equ 0005h
LCDDATA17_SEG45COM2_SIZE                 equ 0001h
LCDDATA17_SEG45COM2_LENGTH               equ 0001h
LCDDATA17_SEG45COM2_MASK                 equ 0020h
LCDDATA17_SEG46COM2_POSN                 equ 0006h
LCDDATA17_SEG46COM2_POSITION             equ 0006h
LCDDATA17_SEG46COM2_SIZE                 equ 0001h
LCDDATA17_SEG46COM2_LENGTH               equ 0001h
LCDDATA17_SEG46COM2_MASK                 equ 0040h
LCDDATA17_SEG47COM2_POSN                 equ 0007h
LCDDATA17_SEG47COM2_POSITION             equ 0007h
LCDDATA17_SEG47COM2_SIZE                 equ 0001h
LCDDATA17_SEG47COM2_LENGTH               equ 0001h
LCDDATA17_SEG47COM2_MASK                 equ 0080h

// Register: LCDDATA18
#define LCDDATA18 LCDDATA18
LCDDATA18                                equ 0F77h
// bitfield definitions
LCDDATA18_LCDDATA18_POSN                 equ 0000h
LCDDATA18_LCDDATA18_POSITION             equ 0000h
LCDDATA18_LCDDATA18_SIZE                 equ 0008h
LCDDATA18_LCDDATA18_LENGTH               equ 0008h
LCDDATA18_LCDDATA18_MASK                 equ 00FFh
LCDDATA18_S0C3_POSN                      equ 0000h
LCDDATA18_S0C3_POSITION                  equ 0000h
LCDDATA18_S0C3_SIZE                      equ 0001h
LCDDATA18_S0C3_LENGTH                    equ 0001h
LCDDATA18_S0C3_MASK                      equ 0001h
LCDDATA18_S1C3_POSN                      equ 0001h
LCDDATA18_S1C3_POSITION                  equ 0001h
LCDDATA18_S1C3_SIZE                      equ 0001h
LCDDATA18_S1C3_LENGTH                    equ 0001h
LCDDATA18_S1C3_MASK                      equ 0002h
LCDDATA18_S2C3_POSN                      equ 0002h
LCDDATA18_S2C3_POSITION                  equ 0002h
LCDDATA18_S2C3_SIZE                      equ 0001h
LCDDATA18_S2C3_LENGTH                    equ 0001h
LCDDATA18_S2C3_MASK                      equ 0004h
LCDDATA18_S3C3_POSN                      equ 0003h
LCDDATA18_S3C3_POSITION                  equ 0003h
LCDDATA18_S3C3_SIZE                      equ 0001h
LCDDATA18_S3C3_LENGTH                    equ 0001h
LCDDATA18_S3C3_MASK                      equ 0008h
LCDDATA18_S4C3_POSN                      equ 0004h
LCDDATA18_S4C3_POSITION                  equ 0004h
LCDDATA18_S4C3_SIZE                      equ 0001h
LCDDATA18_S4C3_LENGTH                    equ 0001h
LCDDATA18_S4C3_MASK                      equ 0010h
LCDDATA18_S5C3_POSN                      equ 0005h
LCDDATA18_S5C3_POSITION                  equ 0005h
LCDDATA18_S5C3_SIZE                      equ 0001h
LCDDATA18_S5C3_LENGTH                    equ 0001h
LCDDATA18_S5C3_MASK                      equ 0020h
LCDDATA18_S6C3_POSN                      equ 0006h
LCDDATA18_S6C3_POSITION                  equ 0006h
LCDDATA18_S6C3_SIZE                      equ 0001h
LCDDATA18_S6C3_LENGTH                    equ 0001h
LCDDATA18_S6C3_MASK                      equ 0040h
LCDDATA18_S7C3_POSN                      equ 0007h
LCDDATA18_S7C3_POSITION                  equ 0007h
LCDDATA18_S7C3_SIZE                      equ 0001h
LCDDATA18_S7C3_LENGTH                    equ 0001h
LCDDATA18_S7C3_MASK                      equ 0080h
LCDDATA18_SEG0COM3_POSN                  equ 0000h
LCDDATA18_SEG0COM3_POSITION              equ 0000h
LCDDATA18_SEG0COM3_SIZE                  equ 0001h
LCDDATA18_SEG0COM3_LENGTH                equ 0001h
LCDDATA18_SEG0COM3_MASK                  equ 0001h
LCDDATA18_SEG1COM3_POSN                  equ 0001h
LCDDATA18_SEG1COM3_POSITION              equ 0001h
LCDDATA18_SEG1COM3_SIZE                  equ 0001h
LCDDATA18_SEG1COM3_LENGTH                equ 0001h
LCDDATA18_SEG1COM3_MASK                  equ 0002h
LCDDATA18_SEG2COM3_POSN                  equ 0002h
LCDDATA18_SEG2COM3_POSITION              equ 0002h
LCDDATA18_SEG2COM3_SIZE                  equ 0001h
LCDDATA18_SEG2COM3_LENGTH                equ 0001h
LCDDATA18_SEG2COM3_MASK                  equ 0004h
LCDDATA18_SEG3COM3_POSN                  equ 0003h
LCDDATA18_SEG3COM3_POSITION              equ 0003h
LCDDATA18_SEG3COM3_SIZE                  equ 0001h
LCDDATA18_SEG3COM3_LENGTH                equ 0001h
LCDDATA18_SEG3COM3_MASK                  equ 0008h
LCDDATA18_SEG4COM3_POSN                  equ 0004h
LCDDATA18_SEG4COM3_POSITION              equ 0004h
LCDDATA18_SEG4COM3_SIZE                  equ 0001h
LCDDATA18_SEG4COM3_LENGTH                equ 0001h
LCDDATA18_SEG4COM3_MASK                  equ 0010h
LCDDATA18_SEG5COM3_POSN                  equ 0005h
LCDDATA18_SEG5COM3_POSITION              equ 0005h
LCDDATA18_SEG5COM3_SIZE                  equ 0001h
LCDDATA18_SEG5COM3_LENGTH                equ 0001h
LCDDATA18_SEG5COM3_MASK                  equ 0020h
LCDDATA18_SEG6COM3_POSN                  equ 0006h
LCDDATA18_SEG6COM3_POSITION              equ 0006h
LCDDATA18_SEG6COM3_SIZE                  equ 0001h
LCDDATA18_SEG6COM3_LENGTH                equ 0001h
LCDDATA18_SEG6COM3_MASK                  equ 0040h
LCDDATA18_SEG7COM3_POSN                  equ 0007h
LCDDATA18_SEG7COM3_POSITION              equ 0007h
LCDDATA18_SEG7COM3_SIZE                  equ 0001h
LCDDATA18_SEG7COM3_LENGTH                equ 0001h
LCDDATA18_SEG7COM3_MASK                  equ 0080h
LCDDATA18_S00C3_POSN                     equ 0000h
LCDDATA18_S00C3_POSITION                 equ 0000h
LCDDATA18_S00C3_SIZE                     equ 0001h
LCDDATA18_S00C3_LENGTH                   equ 0001h
LCDDATA18_S00C3_MASK                     equ 0001h
LCDDATA18_S01C3_POSN                     equ 0001h
LCDDATA18_S01C3_POSITION                 equ 0001h
LCDDATA18_S01C3_SIZE                     equ 0001h
LCDDATA18_S01C3_LENGTH                   equ 0001h
LCDDATA18_S01C3_MASK                     equ 0002h
LCDDATA18_S02C3_POSN                     equ 0002h
LCDDATA18_S02C3_POSITION                 equ 0002h
LCDDATA18_S02C3_SIZE                     equ 0001h
LCDDATA18_S02C3_LENGTH                   equ 0001h
LCDDATA18_S02C3_MASK                     equ 0004h
LCDDATA18_S03C3_POSN                     equ 0003h
LCDDATA18_S03C3_POSITION                 equ 0003h
LCDDATA18_S03C3_SIZE                     equ 0001h
LCDDATA18_S03C3_LENGTH                   equ 0001h
LCDDATA18_S03C3_MASK                     equ 0008h
LCDDATA18_S04C3_POSN                     equ 0004h
LCDDATA18_S04C3_POSITION                 equ 0004h
LCDDATA18_S04C3_SIZE                     equ 0001h
LCDDATA18_S04C3_LENGTH                   equ 0001h
LCDDATA18_S04C3_MASK                     equ 0010h
LCDDATA18_S05C3_POSN                     equ 0005h
LCDDATA18_S05C3_POSITION                 equ 0005h
LCDDATA18_S05C3_SIZE                     equ 0001h
LCDDATA18_S05C3_LENGTH                   equ 0001h
LCDDATA18_S05C3_MASK                     equ 0020h
LCDDATA18_S06C3_POSN                     equ 0006h
LCDDATA18_S06C3_POSITION                 equ 0006h
LCDDATA18_S06C3_SIZE                     equ 0001h
LCDDATA18_S06C3_LENGTH                   equ 0001h
LCDDATA18_S06C3_MASK                     equ 0040h
LCDDATA18_S07C3_POSN                     equ 0007h
LCDDATA18_S07C3_POSITION                 equ 0007h
LCDDATA18_S07C3_SIZE                     equ 0001h
LCDDATA18_S07C3_LENGTH                   equ 0001h
LCDDATA18_S07C3_MASK                     equ 0080h

// Register: LCDDATA19
#define LCDDATA19 LCDDATA19
LCDDATA19                                equ 0F78h
// bitfield definitions
LCDDATA19_LCDDATA19_POSN                 equ 0000h
LCDDATA19_LCDDATA19_POSITION             equ 0000h
LCDDATA19_LCDDATA19_SIZE                 equ 0008h
LCDDATA19_LCDDATA19_LENGTH               equ 0008h
LCDDATA19_LCDDATA19_MASK                 equ 00FFh
LCDDATA19_S8C3_POSN                      equ 0000h
LCDDATA19_S8C3_POSITION                  equ 0000h
LCDDATA19_S8C3_SIZE                      equ 0001h
LCDDATA19_S8C3_LENGTH                    equ 0001h
LCDDATA19_S8C3_MASK                      equ 0001h
LCDDATA19_S9C3_POSN                      equ 0001h
LCDDATA19_S9C3_POSITION                  equ 0001h
LCDDATA19_S9C3_SIZE                      equ 0001h
LCDDATA19_S9C3_LENGTH                    equ 0001h
LCDDATA19_S9C3_MASK                      equ 0002h
LCDDATA19_S10C3_POSN                     equ 0002h
LCDDATA19_S10C3_POSITION                 equ 0002h
LCDDATA19_S10C3_SIZE                     equ 0001h
LCDDATA19_S10C3_LENGTH                   equ 0001h
LCDDATA19_S10C3_MASK                     equ 0004h
LCDDATA19_S11C3_POSN                     equ 0003h
LCDDATA19_S11C3_POSITION                 equ 0003h
LCDDATA19_S11C3_SIZE                     equ 0001h
LCDDATA19_S11C3_LENGTH                   equ 0001h
LCDDATA19_S11C3_MASK                     equ 0008h
LCDDATA19_S12C3_POSN                     equ 0004h
LCDDATA19_S12C3_POSITION                 equ 0004h
LCDDATA19_S12C3_SIZE                     equ 0001h
LCDDATA19_S12C3_LENGTH                   equ 0001h
LCDDATA19_S12C3_MASK                     equ 0010h
LCDDATA19_S13C3_POSN                     equ 0005h
LCDDATA19_S13C3_POSITION                 equ 0005h
LCDDATA19_S13C3_SIZE                     equ 0001h
LCDDATA19_S13C3_LENGTH                   equ 0001h
LCDDATA19_S13C3_MASK                     equ 0020h
LCDDATA19_S14C3_POSN                     equ 0006h
LCDDATA19_S14C3_POSITION                 equ 0006h
LCDDATA19_S14C3_SIZE                     equ 0001h
LCDDATA19_S14C3_LENGTH                   equ 0001h
LCDDATA19_S14C3_MASK                     equ 0040h
LCDDATA19_S15C3_POSN                     equ 0007h
LCDDATA19_S15C3_POSITION                 equ 0007h
LCDDATA19_S15C3_SIZE                     equ 0001h
LCDDATA19_S15C3_LENGTH                   equ 0001h
LCDDATA19_S15C3_MASK                     equ 0080h
LCDDATA19_SEG8COM3_POSN                  equ 0000h
LCDDATA19_SEG8COM3_POSITION              equ 0000h
LCDDATA19_SEG8COM3_SIZE                  equ 0001h
LCDDATA19_SEG8COM3_LENGTH                equ 0001h
LCDDATA19_SEG8COM3_MASK                  equ 0001h
LCDDATA19_SEG9COM3_POSN                  equ 0001h
LCDDATA19_SEG9COM3_POSITION              equ 0001h
LCDDATA19_SEG9COM3_SIZE                  equ 0001h
LCDDATA19_SEG9COM3_LENGTH                equ 0001h
LCDDATA19_SEG9COM3_MASK                  equ 0002h
LCDDATA19_SEG10COM3_POSN                 equ 0002h
LCDDATA19_SEG10COM3_POSITION             equ 0002h
LCDDATA19_SEG10COM3_SIZE                 equ 0001h
LCDDATA19_SEG10COM3_LENGTH               equ 0001h
LCDDATA19_SEG10COM3_MASK                 equ 0004h
LCDDATA19_SEG11COM3_POSN                 equ 0003h
LCDDATA19_SEG11COM3_POSITION             equ 0003h
LCDDATA19_SEG11COM3_SIZE                 equ 0001h
LCDDATA19_SEG11COM3_LENGTH               equ 0001h
LCDDATA19_SEG11COM3_MASK                 equ 0008h
LCDDATA19_SEG12COM3_POSN                 equ 0004h
LCDDATA19_SEG12COM3_POSITION             equ 0004h
LCDDATA19_SEG12COM3_SIZE                 equ 0001h
LCDDATA19_SEG12COM3_LENGTH               equ 0001h
LCDDATA19_SEG12COM3_MASK                 equ 0010h
LCDDATA19_SEG13COM3_POSN                 equ 0005h
LCDDATA19_SEG13COM3_POSITION             equ 0005h
LCDDATA19_SEG13COM3_SIZE                 equ 0001h
LCDDATA19_SEG13COM3_LENGTH               equ 0001h
LCDDATA19_SEG13COM3_MASK                 equ 0020h
LCDDATA19_SEG14COM3_POSN                 equ 0006h
LCDDATA19_SEG14COM3_POSITION             equ 0006h
LCDDATA19_SEG14COM3_SIZE                 equ 0001h
LCDDATA19_SEG14COM3_LENGTH               equ 0001h
LCDDATA19_SEG14COM3_MASK                 equ 0040h
LCDDATA19_SEG15COM3_POSN                 equ 0007h
LCDDATA19_SEG15COM3_POSITION             equ 0007h
LCDDATA19_SEG15COM3_SIZE                 equ 0001h
LCDDATA19_SEG15COM3_LENGTH               equ 0001h
LCDDATA19_SEG15COM3_MASK                 equ 0080h
LCDDATA19_S08C3_POSN                     equ 0000h
LCDDATA19_S08C3_POSITION                 equ 0000h
LCDDATA19_S08C3_SIZE                     equ 0001h
LCDDATA19_S08C3_LENGTH                   equ 0001h
LCDDATA19_S08C3_MASK                     equ 0001h
LCDDATA19_S09C3_POSN                     equ 0001h
LCDDATA19_S09C3_POSITION                 equ 0001h
LCDDATA19_S09C3_SIZE                     equ 0001h
LCDDATA19_S09C3_LENGTH                   equ 0001h
LCDDATA19_S09C3_MASK                     equ 0002h
LCDDATA19_T3CKPS019_POSN                 equ 0004h
LCDDATA19_T3CKPS019_POSITION             equ 0004h
LCDDATA19_T3CKPS019_SIZE                 equ 0001h
LCDDATA19_T3CKPS019_LENGTH               equ 0001h
LCDDATA19_T3CKPS019_MASK                 equ 0010h
LCDDATA19_T3CKPS119_POSN                 equ 0005h
LCDDATA19_T3CKPS119_POSITION             equ 0005h
LCDDATA19_T3CKPS119_SIZE                 equ 0001h
LCDDATA19_T3CKPS119_LENGTH               equ 0001h
LCDDATA19_T3CKPS119_MASK                 equ 0020h
LCDDATA19_TMR3CS019_POSN                 equ 0006h
LCDDATA19_TMR3CS019_POSITION             equ 0006h
LCDDATA19_TMR3CS019_SIZE                 equ 0001h
LCDDATA19_TMR3CS019_LENGTH               equ 0001h
LCDDATA19_TMR3CS019_MASK                 equ 0040h
LCDDATA19_TMR3CS119_POSN                 equ 0007h
LCDDATA19_TMR3CS119_POSITION             equ 0007h
LCDDATA19_TMR3CS119_SIZE                 equ 0001h
LCDDATA19_TMR3CS119_LENGTH               equ 0001h
LCDDATA19_TMR3CS119_MASK                 equ 0080h

